Tekla Open API Reference for Tekla Structures 2025
LineTypes Explicit Conversion Operators
Overload List
Name | Description
Explicit(Int32 to LineTypes)
 Returns the corresponding LineTypes value of the given int value.
Explicit(LineTypes to Int32)
 Returns the corresponding int value of the given LineTypes value.
Top
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace